In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import plotly.express as px

In [2]:
pd.set_option('display.max_columns',None)

In [3]:
data = pd.read_csv('./Car_sales (4).csv')

In [4]:
data.head()

,Manufacturer,Model,Sales_in_thousands,__year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639

In [5]:
#1 count of manufactores
data.Manufacturer.nunique()

30

In [6]:
#2 count of models
data.Model.nunique()

156

In [7]:
#3 count of vehicle type
data.Vehicle_type.nunique()

2

In [8]:
#4 maximum sales in thousands
data.Sales_in_thousands.max()

540.561

In [9]:
data[data['Sales_in_thousands']==540.561]

,Manufacturer,Model,Sales_in_thousands,__year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
56,Ford,F-Series,540.561,15.075,Car,26.935,4.6,220.0,138.5,79.1,224.5,4.241,25.1,18.0,8/16/2012,89.401935

In [10]:
#5 minimum sales in thousands
data.Sales_in_thousands.min()

0.11

In [11]:
data[data['Sales_in_thousands']==0.11]

,Manufacturer,Model,Sales_in_thousands,__year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
83,Mitsubishi,3000GT,0.11,20.94,Passenger,25.45,3.0,161.0,97.2,72.4,180.3,3.131,19.8,21.0,6/29/2012,67.544155

In [12]:
#6 average sales in thousands
data.Sales_in_thousands.mean()

52.99807643312102

In [13]:
#7 maximum year resale value
data.__year_resale_value.max()

67.55

In [14]:
#8 minimum year resale value
data.__year_resale_value.min()

5.16

In [15]:
#9 average year resale value
data.__year_resale_value.mean()

18.072975206611574

In [16]:
#10 maximum price in thousands
data.Price_in_thousands.max()

85.5

In [17]:
#11 minimum price in thousands
data.Price_in_thousands.min()

9.235

In [18]:
#12 average price in thousands
data.Price_in_thousands.mean()

27.39075483870966

In [19]:
#13 maximum engine size
data.Engine_size.max()

8.0

In [20]:
#14 minimum engine size
data.Engine_size.min()

1.0

In [21]:
#15 average engine size
data.Engine_size.mean()

3.060897435897434

In [22]:
#16 maximum hp
data.Horsepower.max()

450.0

In [23]:
#17 minimum hp
data.Horsepower.min()

55.0

In [24]:
#18 average hp
data.Horsepower.mean()

185.94871794871796

In [25]:
#19 maximum width
data.Width.max()

79.9

In [26]:
#20 minimum width
data.Width.min()

62.6

In [27]:
#21 average width
data.Width.mean()

71.14999999999996

In [28]:
#22 maximum wheelbase
data.Wheelbase.max()

138.7

In [29]:
#23 minimum wheelbase
data.Wheelbase.min()

92.6

In [30]:
#24 average wheelbase
data.Wheelbase.mean()

107.48717948717949

In [31]:
#25 maximum curb weight
data.Curb_weight.max()

5.572

In [32]:
#26 minimum curb weight
data.Curb_weight.min()

1.895

In [33]:
#27 average curb weight
data.Curb_weight.mean()

3.378025806451613

In [34]:
#28 maximum length
data.Length.max()

224.5

In [35]:
#29 minimum length
data.Length.min()

149.4

In [36]:
#30 average length
data.Length.mean()

187.34358974358977

In [37]:
#31 maximum fuel capacity
data.Fuel_capacity.max()

32.0

In [38]:
#32 minimum fuel capacity
data.Fuel_capacity.min()

10.3

In [39]:
#33 average fuel capacity
data.Fuel_capacity.mean()

17.951923076923084

In [40]:
#34 maximum fuel effuciency
data.Fuel_efficiency.max()

45.0

In [41]:
#35 minimum fuel effuciency
data.Fuel_efficiency.min()

15.0

In [42]:
#36 average fuel effuciency
data.Fuel_efficiency.mean()

23.844155844155843

In [43]:
#37 maximum power perfect factor
data.Power_perf_factor.max()

188.144323

In [44]:
#38 minimum power perfect factor
data.Power_perf_factor.min()

23.27627233

In [45]:
#39 average power perfect factor
data.Power_perf_factor.mean()

77.0435912007742

In [46]:
#40 most selling manufactorer
most_sell=data.groupby(['Manufacturer'])['Sales_in_thousands'].sum().reset_index()
most_sell.sort_values(by='Sales_in_thousands',ascending=False)

   Manufacturer  Sales_in_thousands
8          Ford            2022.635
7         Dodge             910.149
27       Toyota             740.205
9         Honda             592.674
5     Chevrolet             554.365
19       Nissan             399.635
22      Pontiac             370.534
13         Jeep             293.153
3         Buick             242.019
17      Mercury             237.999
28   Volkswagen             209.212
6      Chrysler             201.721
18   Mitsubishi             180.895
20   Oldsmobile             178.989
25       Saturn             168.850
10      Hyundai             137.326
16   Mercedes-B             117.125
4      Cadillac             112.178
14        Lexus             106.843
15      Lincoln              85.634
26       Subaru              80.135
0         Acura              79.005
29        Volvo              75.740
21     Plymouth              64.001
2           BMW              46.505
1          Audi              40.557
11     Infiniti              23.713
24         Saab              21.306
12       Jaguar              15.467
23      Porsche              12.128

In [47]:
most_sell.Sales_in_thousands.max()

2022.635

In [48]:
#41 least selling manufactorer
most_sell.sort_values(by='Sales_in_thousands')

   Manufacturer  Sales_in_thousands
23      Porsche              12.128
12       Jaguar              15.467
24         Saab              21.306
11     Infiniti              23.713
1          Audi              40.557
2           BMW              46.505
21     Plymouth              64.001
29        Volvo              75.740
0         Acura              79.005
26       Subaru              80.135
15      Lincoln              85.634
14        Lexus             106.843
4      Cadillac             112.178
16   Mercedes-B             117.125
10      Hyundai             137.326
25       Saturn             168.850
20   Oldsmobile             178.989
18   Mitsubishi             180.895
6      Chrysler             201.721
28   Volkswagen             209.212
17      Mercury             237.999
3         Buick             242.019
13         Jeep             293.153
22      Pontiac             370.534
19       Nissan             399.635
5     Chevrolet             554.365
9         Honda             592.674
27       Toyota             740.205
7         Dodge             910.149
8          Ford            2022.635

In [49]:
#42 most selling model
most_sellm=data.groupby(['Model'])['Sales_in_thousands'].sum().reset_index()

In [50]:
most_sellm.sort_values(by='Sales_in_thousands')

             Model  Sales_in_thousands
1           3000GT               0.110
151          Viper               0.916
26           CL500               0.954
49         Cutlass               1.112
34   Carrera Coupe               1.280
..             ...                 ...
12          Accord             230.902
145         Taurus             245.815
31           Camry             247.994
62        Explorer             276.747
63        F-Series             540.561

[156 rows x 2 columns]

In [51]:
most_sellm.nlargest(5,"Sales_in_thousands")

        Model  Sales_in_thousands
63   F-Series             540.561
62   Explorer             276.747
31      Camry             247.994
145    Taurus             245.815
12     Accord             230.902

In [52]:
most_sellm.nlargest(1,"Sales_in_thousands")

       Model  Sales_in_thousands
63  F-Series             540.561

In [53]:
#43 least selling model
most_sellm.nsmallest(2,'Sales_in_thousands')

      Model  Sales_in_thousands
1    3000GT               0.110
151   Viper               0.916

In [56]:
#44 manufatorer with maximum engine size
most_selle=data.groupby(['Manufacturer'])['Engine_size'].max().reset_index()
most_selle.nlargest(2,'Engine_size')

  Manufacturer  Engine_size
7        Dodge          8.0
4     Cadillac          5.7

In [57]:
#45 manufatorer with minimum engine size
most_selle.nsmallest(2,'Engine_size')

   Manufacturer  Engine_size
28   Volkswagen          2.0
25       Saturn          2.2

In [58]:
#46 manufacturer with maximum hp
most_sellh=data.groupby(['Manufacturer'])['Horsepower'].max().reset_index()
most_sellh.nlargest(2,'Horsepower')

  Manufacturer  Horsepower
7        Dodge       450.0
5    Chevrolet       345.0

In [59]:
most_sellh.Horsepower.max()

450.0

In [60]:
most_sellh[most_sellh['Horsepower']==450]

  Manufacturer  Horsepower
7        Dodge       450.0

In [61]:
#47 manufatorer with minimum hp
most_sellh.nsmallest(2,'Horsepower')

   Manufacturer  Horsepower
25       Saturn       137.0
10      Hyundai       148.0

In [62]:
#48 model with sales in thousands
most_sellm=data.groupby(['Model'])['Sales_in_thousands'].sum().reset_index()
most_sellm

        Model  Sales_in_thousands
0       3-Sep              12.115
1      3000GT               0.110
2        300M              30.696
3        323i              19.747
4        328i               9.231
..        ...                 ...
151     Viper               0.916
152   Voyager              24.155
153  Windstar             155.787
154  Wrangler              55.557
155    Xterra              54.158

[156 rows x 2 columns]

In [63]:
#49 model with maximum sales in thousands
most_sellm.nlargest(2,'Sales_in_thousands')

       Model  Sales_in_thousands
63  F-Series             540.561
62  Explorer             276.747

In [64]:
most_sellm[most_sellm["Sales_in_thousands"]==540.561]

       Model  Sales_in_thousands
63  F-Series             540.561

In [65]:
most_sellm[most_sellm.Sales_in_thousands==most_sellm.Sales_in_thousands.max()]

       Model  Sales_in_thousands
63  F-Series             540.561

In [66]:
#50 model with minimum sales in thousands
most_sellm.nsmallest(2,'Sales_in_thousands')

      Model  Sales_in_thousands
1    3000GT               0.110
151   Viper               0.916

In [67]:
#51 model with maximum year sale value
most_year=data.groupby(['Model'])['__year_resale_value'].max().reset_index()
most_year.nlargest(2,"__year_resale_value")

             Model  __year_resale_value
33  Carrera Cabrio               67.550
34   Carrera Coupe               60.625

In [68]:
#52  model with minimum year sale value
most_year.nsmallest(2,"__year_resale_value")

     Model  __year_resale_value
94   Metro                 5.16
11  Accent                 5.86

In [69]:
#53 vehicle type with sales in thousands
vehicle=data.groupby(['Vehicle_type'])['Sales_in_thousands'].max().reset_index()

In [71]:
#54 vehicle type with maximum sales in thousands
vehicle

  Vehicle_type  Sales_in_thousands
0          Car             540.561
1    Passenger             247.994

In [72]:
#55 vehicle type with minimum sales in thousands
vehicle1=data.groupby(['Vehicle_type'])['Sales_in_thousands'].min().reset_index()
vehicle1

  Vehicle_type  Sales_in_thousands
0          Car               9.126
1    Passenger               0.110

In [73]:
#56 vehicle type with year sale value
vehicle_year=data.groupby(['Vehicle_type'])['__year_resale_value'].max().reset_index()

In [74]:
#57 vehicle type with max year sale value
vehicle_year

  Vehicle_type  __year_resale_value
0          Car                34.08
1    Passenger                67.55

In [75]:
#58 vehicle type with min year sale value
vehicle_year1=data.groupby(['Vehicle_type'])['__year_resale_value'].min().reset_index()

In [76]:
vehicle_year1

  Vehicle_type  __year_resale_value
0          Car                 7.85
1    Passenger                 5.16